app/controllers/posts_controller.rb

	def create
    @post = current_user.posts.build(post_params)
    if @post.save
---
INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "asdfasdf"], ["user_id", 102], ["created_at", "2016-11-28 06:40:33.178798"], ["updated_at", "2016-11-28 06:40:33.178798"]]