app/controllers/static_pages_controller.rb

	def home
		if logged_in?
      		@post  = current_user.posts.build
      		@feed_items = current_user.feed.paginate(page: params[:page])
---
SELECT  "posts".* FROM "posts" WHERE (user_id = 102) LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 102]]