app/controllers/users_controller.rb

  def show
  	@user = User.find(params[:id])
    @posts = @user.posts.paginate(page: params[:page])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = ? LIMIT 30 OFFSET 0  [["user_id", 102]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 102]]